# -*- coding: utf-8 -*-
""" Програма використовує flask та запускає веб-сервер.
За запитом до цього сервера він повертає текст "Привіт, Мир!" """
import sqlite3

from flask import Flask

def index():
    conn = sqlite3.connect("Artistc.db")
    cursos = conn.cursor()
    cursos.execute('SELECT name FROM artists WHERE "Birth Year" =(?), [year]')

    if len(data) == 0:
        return 'no adta about'+ str(year)+ 'year'

    elif len(data) ==1:
        return 'Y' + str(year) + 'році народився (народився)' + data[0][0]

    else:
        result = '<h3>'Список художників, які народилася в ' + str(year) + 'році:</h3><ol>'
        for person in data:
            result += '<li>' + person[0] + '<li>'
        result += '</ol>'
        print(result)
    return sesult


    """ Функція повертає текст документа """
    return 'Привіт, світ!' 

# Створюємо об'єкт веб-програми:
app = Flask(__name__)   # параметр - ім'я модуля для веб-програми
                        # значення __name__ містить коректне ім'я модуля для поточного файлу
                        # у ньому буде значення "__main__", якщо модуль запускається безпосередньо
                        # та інше ім'я, якщо модуль підключається

app.add_url_rule('/', 'index', index)   # створює правило для URL:
                                        # при отриманні GET-запиту на адресу '/' на цьому сайті
                                        # запускатиметься функція index (вказана третім параметром)
                                        # та її значення буде відповіддю на запит.
                                        # Другий параметр - endpoint, "кінцева точка", -
                                        # це рядок, який містить ім'я цього правила.
                                        # Зазвичай endpoint рекомендують робити ідентичним ім'я функції,
                                        # але в складних додатках може бути кілька функцій з одним ім'ям у різних модулях,


                                        # і для розрізнення їх у межах всього сайту можна вказувати різні endpoint.
year = int(input('Введіть рік народження художника')
if __name__ == "__main__":
    # Запускаємо веб-сервер:
    app.run() 
